In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.rand(5,3),index=['a','c','e','f','h'],columns=['one','two','three'])

In [3]:
df = df.reindex(['a','b','c','d','e','f','g','h'])

In [4]:
df

        one       two     three
a  0.819007  0.343854  0.717917
b       NaN       NaN       NaN
c  0.020918  0.557131  0.859755
d       NaN       NaN       NaN
e  0.233178  0.767784  0.678720
f  0.448384  0.683313  0.223512
g       NaN       NaN       NaN
h  0.898528  0.348046  0.197730

In [5]:
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [6]:
df['two'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: two, dtype: bool

In [7]:
df['three'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: three, dtype: bool

In [8]:
# True indicates that there is a missing value
df.isnull()

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False

In [9]:
# Filling missing values with 0
df.fillna(0)

        one       two     three
a  0.819007  0.343854  0.717917
b  0.000000  0.000000  0.000000
c  0.020918  0.557131  0.859755
d  0.000000  0.000000  0.000000
e  0.233178  0.767784  0.678720
f  0.448384  0.683313  0.223512
g  0.000000  0.000000  0.000000
h  0.898528  0.348046  0.197730

In [10]:
df.mean()

one      0.484003
two      0.540026
three    0.535527
dtype: float64

In [11]:
# missing values are filled with mean value of the respective columns
df.fillna(df.mean())

        one       two     three
a  0.116067  0.335101  0.729159
b  0.375022  0.511555  0.448023
c  0.500214  0.234608  0.617594
d  0.375022  0.511555  0.448023
e  0.414402  0.377609  0.075075
f  0.293304  0.646881  0.698272
g  0.375022  0.511555  0.448023
h  0.551121  0.963576  0.120017

In [11]:
df.median()

one      0.448384
two      0.557131
three    0.678720
dtype: float64

In [12]:
# missing values are filled with median value of the respective columns
df.fillna(df.median())

        one       two     three
a  0.819007  0.343854  0.717917
b  0.448384  0.557131  0.678720
c  0.020918  0.557131  0.859755
d  0.448384  0.557131  0.678720
e  0.233178  0.767784  0.678720
f  0.448384  0.683313  0.223512
g  0.448384  0.557131  0.678720
h  0.898528  0.348046  0.197730

In [13]:
# Original dataframe
df

        one       two     three
a  0.819007  0.343854  0.717917
b       NaN       NaN       NaN
c  0.020918  0.557131  0.859755
d       NaN       NaN       NaN
e  0.233178  0.767784  0.678720
f  0.448384  0.683313  0.223512
g       NaN       NaN       NaN
h  0.898528  0.348046  0.197730

In [14]:
# Drop the rows containing missing values
df.dropna()

        one       two     three
a  0.819007  0.343854  0.717917
c  0.020918  0.557131  0.859755
e  0.233178  0.767784  0.678720
f  0.448384  0.683313  0.223512
h  0.898528  0.348046  0.197730